import img1 from "../../assets/img/cardBg2.svg";
import img2 from "../../assets/img/cardBg.svg";
import img3 from "../../assets/img/cardBg3.svg";
import img4 from "../../assets/img/cardBg4.svg";
import img5 from "../../assets/img/cardBg5.svg";
import img6 from "../../assets/img/cardBg6.svg";
import img7 from "../../assets/img/cardBg7.svg";
import img8 from "../../assets/img/cardBg8.svg";
//
import product1 from "../../assets/img/productImg1.png";
import product2 from "../../assets/img/productImg2.png";
import product3 from "../../assets/img/productImg3.png";

//
export let Imgs = [
  {
    id: "1",
    img: img1,
    title: `Колбасные
и мясные изделия`,
    desc: "Цена от 150 ₽",
    text: `
56 товаров`,
    p: "28px 0px 0px 29px",
    w: "387px",
    color:
      "radial-gradient(101.3% 131.42% at 94.3% 92.41%, #F6C669 0%, #C5624C 100%)",
  },
  {
    id: "2",
    img: img2,
    title: `Молочные продукты`,
    text: `
    Сыры, Десерты, Йогурты, Кисломолочная продукция, Молоко, Сметана, Творог, Творожная масса`,
    p: "28px 0px 0px 29px",
    w: "387px",
    color:
      "radial-gradient(101.3% 131.42% at 94.3% 92.41%, #FFE486 0%, #959020 100%)",
  },
  {
    id: "3",
    img: img3,
    title: `Морепродукты`,
    text: `
    Рыба, Икра, Креветки`,
    p: "28px 0px 0px 29px",
    w: "387px",
    color:
      " radial-gradient(101.3% 131.42% at 94.3% 92.41%, #A5C9AF 0%, #578D4E 100%)",
  },
  {
    id: "4",
    img: img4,
    title: `Пиво`,
    text: `Крафтовое пиво`,
    p: "28px 0px 0px 29px",
    w: "570px",
    color:
      " radial-gradient(101.3% 131.42% at 94.3% 92.41%, #F3DF77 0%, #FCA727 100%)",
  },
  {
    id: "5",
    img: img5,
    title: `Замороженные
    продукты`,
    text: `Замороженные овощи, Замороженные фркуты`,
    p: "28px 0px 0px 29px",
    w: "570px",
    color:
      " radial-gradient(101.3% 131.42% at 94.3% 92.41%, #7BCAC0 0%, #39817C 100%)",
  },
  {
    id: "6",
    img: img6,
    title: `Мёд`,
    text: `Мед горный 0,25 кг, 
    Мед с облепихой 0,25 кг,
    Мед с черникой 0,25 кг,
    Мед с разнотравья 0,25 кг,
    Мед цветочный 0,25 кг
     `,
    p: "28px 0px 0px 29px",
    w: "387px",
    color:
      "  radial-gradient(101.3% 131.42% at 94.3% 92.41%, #9DBDCF 0%, #374B69 100%)",
  },
  {
    id: "7",
    img: img7,
    title: `Свежие овощи`,
    text: `Картофель, Огурцы, Помидоры
     `,
    p: "28px 0px 0px 29px",
    w: "387px",
    color:
      "  radial-gradient(119.19% 131.42% at 94.3% 92.41%, #FFEBB7 0%, #8C3F6D 100%)",
  },
  {
    id: "8",
    img: img8,
    title: `Свежие фрукты`,
    text: `Сезонные яблоки
     `,
    p: "28px 0px 0px 29px",
    w: "387px",
    color:
      "   radial-gradient(101.3% 131.42% at 94.3% 92.41%, #FFE483 0%, #F47933 100%)",
  },
];
//
export const ProductData = [
  {
    id: 1,
    title: "Говядина, кусок с/к",
    text: "Свинина, смесь посолочная (соль, нитрит натрия), коньяк, натуральные специи, сахар.",
    price: "500 ₽",
    oldPrice: "660 ₽",
    sale: "-15%",
    url: product1,
    desc: "Экономия 160 ₽",
  },
  {
    id: 2,
    title: "Говядина, кусок с/к",
    text: "Свинина, смесь посолочная (соль, нитрит натрия), коньяк, натуральные специи, сахар.",
    price: "500 ₽",
    oldPrice: "660 ₽",
    sale: "-15%",
    url: product2,
    desc: "Экономия 160 ₽",
  },
  {
    id: 3,
    title: "Говядина, кусок с/к",
    text: "Свинина, смесь посолочная (соль, нитрит натрия), коньяк, натуральные специи, сахар.",
    price: "500 ₽",
    oldPrice: "660 ₽",
    sale: "-15%",
    url: product1,
    desc: "Экономия 160 ₽",
  },
  {
    id: 4,
    title: "Говядина, кусок с/к",
    text: "Свинина, смесь посолочная (соль, нитрит натрия), коньяк, натуральные специи, сахар.",
    price: "500 ₽",
    oldPrice: "660 ₽",
    sale: "-15%",
    url: product3,
    desc: "Экономия 160 ₽",
  },
];
export const ProductDate = [
  {
    id: 1,
    title: "Говядина, кусок с/к",
    text: "Свинина, смесь посолочная (соль, нитрит натрия), коньяк, натуральные специи, сахар.",
    price: "500 ₽",
    oldPrice: "660 ₽",
    sale: "-15%",
    url: product1,
    desc: "Экономия 160 ₽",
    textdesc:"Колбасы вяленые и сырокопченые",
    composition:"Свинина, смесь посолочная (соль, нитрит натрия), коньяк, натуральные специи, сахар.",
    term:"В вакуумной упаковке 120 суток. После вскрытия употребить в течение 30 суток или до окончания срока годности.",
    type:"Хит",
    Protein:"12г",
    Fats:"12г",
    Calories:"228 ккал",
  },
  {
    id: 2,
    title: "Говядина, кусок с/к",
    text: "Свинина, смесь посолочная (соль, нитрит натрия), коньяк, натуральные специи, сахар.",
    price: "500 ₽",
    oldPrice: "660 ₽",
    sale: "-15%",
    url: product2,
    desc: "Экономия 160 ₽",
    textdesc:"Колбасы вяленые и сырокопченые",
    composition:"Свинина, смесь посолочная (соль, нитрит натрия), коньяк, натуральные специи, сахар.",
    term:"В вакуумной упаковке 120 суток. После вскрытия употребить в течение 30 суток или до окончания срока годности.",
    type:"New",
    Protein:"12г",
    Fats:"12г",
    Calories:"228 ккал",
  },
  {
    id: 3,
    title: "Говядина, кусок с/к",
    text: "Свинина, смесь посолочная (соль, нитрит натрия), коньяк, натуральные специи, сахар.",
    price: "500 ₽",
    oldPrice: "660 ₽",
    sale: "-15%",
    url: product1,
    desc: "Экономия 160 ₽",
    textdesc:"Колбасы вяленые и сырокопченые",
    composition:"Свинина, смесь посолочная (соль, нитрит натрия), коньяк, натуральные специи, сахар.",
    term:"В вакуумной упаковке 120 суток. После вскрытия употребить в течение 30 суток или до окончания срока годности.",
    type:"Скидка",
    Protein:"12г",
    Fats:"12г",
    Calories:"228 ккал",
  },
  {
    id: 4,
    title: "Говядина, кусок с/к",
    text: "Свинина, смесь посолочная (соль, нитрит натрия), коньяк, натуральные специи, сахар.",
    price: "500 ₽",
    oldPrice: "660 ₽",
    sale: "-15%",
    url: product3,
    desc: "Экономия 160 ₽",
    textdesc:"Колбасы вяленые и сырокопченые",
    composition:"Свинина, смесь посолочная (соль, нитрит натрия), коньяк, натуральные специи, сахар.",
    term:"В вакуумной упаковке 120 суток. После вскрытия употребить в течение 30 суток или до окончания срока годности.",
    type:"New",
    Protein:"12г",
    Fats:"12г",
    Calories:"228 ккал",
  },
  {
    id: 5,
    title: "Говядина, кусок с/к",
    text: "Свинина, смесь посолочная (соль, нитрит натрия), коньяк, натуральные специи, сахар.",
    price: "500 ₽",
    oldPrice: "660 ₽",
    sale: "-15%",
    url: product1,
    desc: "Экономия 160 ₽",
    textdesc:"Колбасы вяленые и сырокопченые",
    composition:"Свинина, смесь посолочная (соль, нитрит натрия), коньяк, натуральные специи, сахар.",
    term:"В вакуумной упаковке 120 суток. После вскрытия употребить в течение 30 суток или до окончания срока годности.",
    type:"Скидка",
    Protein:"12г",
    Fats:"12г",
    Calories:"228 ккал",
  },
  {
    id: 6,
    title: "Говядина, кусок с/к",
    text: "Свинина, смесь посолочная (соль, нитрит натрия), коньяк, натуральные специи, сахар.",
    price: "500 ₽",
    oldPrice: "660 ₽",
    sale: "-15%",
    url: product2,
    desc: "Экономия 160 ₽",
    textdesc:"Колбасы вяленые и сырокопченые",
    composition:"Свинина, смесь посолочная (соль, нитрит натрия), коньяк, натуральные специи, сахар.",
    term:"В вакуумной упаковке 120 суток. После вскрытия употребить в течение 30 суток или до окончания срока годности.",
    type:"Хит",
    Protein:"12г",
    Fats:"12г",
    Calories:"228 ккал",
  },
];
export const Type = [
  {
    id: 1,
    text: "Все",
  },
  {
    id: 2,
    text: "Балык",
  },
  {
    id: 3,
    text: "Бекон",
  },
  {
    id: 4,
    text: "Вырезка",
  },
  {
    id: 5,
    text: "Говядина",
  },
  {
    id: 6,
    text: "Голяшка",
  },
  {
    id: 7,
    text: "Грудинка",
  },
  {
    id: 8,
    text: "Карбонад",
  },
  {
    id: 9,
    text: "Корейка",
  },
  {
    id: 10,
    text: "Мясные хлеба",
  },
  {
    id: 11,
    text: "Пасторма",
  },
  {
    id: 12,
    text: "Суджук",
  },
  {
    id: 13,
    text: "Шея",
  },
];
